[
  {
    "title": "Machine Learning Engineer",
    "company": "WRK digital",
    "location": "London Area, United Kingdom",
    "job_link": "https://uk.linkedin.com/jobs/view/machine-learning-engineer-at-wrk-digital-4365114810",
    "posted_date": "1 week ago",
    "description": "Machine Learning Engineer - Outside IR35\nLocation:\nFully Remote - UK\nContract Length:\n3 months initially\nIR35 Status:\nOutside IR35\nStart Date:\nImmediate\n£550-600/day\nWRK digital\nis proud to partner with a fast-growing technology startup building solutions that combine human expertise and AI agents to automate complex operational workflows. The organisations mission is to help businesses solve real-world challenges in areas such as trust, safety, and marketplace operations - enabling them to scale efficiently without the need for complex integrations.\nHaving recently raised over $25M in venture funding from top-tier investors, the company is operating at significant scale, processing millions of images and videos daily. This is an exciting stage of their journey as they look to expand the platform and capabilities over the coming year and beyond.\nThe Role\nWe’re shortlisting for an experienced\nMachine Learning Engineer\nto design, build, and deliver cutting-edge AI solutions for customers. You’ll apply your expertise in software engineering and machine learning to transform manual workflows into automated systems powered by AI.\nYou’ll work closely with customers and internal teams to understand their challenges, develop virtual agents that automate tasks, and build scalable, self-service tools that empower users to achieve value independently.\nKey Responsibilities\nCollaborate with customers to understand workflows and design AI-driven automation solutions.\nContribute to the development of our Virtual Agent platform in line with product strategy.\nEnsure AI services maintain high standards of performance, reliability, and scalability.\nParticipate in internal ML community, influencing how we implement AI and computer vision technologies.\nTake ownership of customer outcomes and contribute across software engineering, DevOps, and MLOps functions.\nAbout You\nWe’re looking for a proactive and versatile engineer who thrives in a collaborative environment and enjoys solving meaningful technical challenges. You’ll be comfortable engaging with customers and internal stakeholders, driving technical delivery, and contributing ideas that shape our product roadmap.\nYou’ll be great for this role if you:\nHave strong\nPython\nand\nmachine learning engineering\nskills, with experience applying AI to real-world problems.\nCan (or want to learn to) build\nagentic AI systems\nthat automate human processes.\nUnderstand (or are keen to learn) software deployment using\nKubernetes\nand related infrastructure tools.\nHave strong problem-solving and project management skills.\nThrive in a collaborative environment where shared success matters most.\nAre open to occasional travel for company-wide gatherings (typically three times per year).\nNice to Have:\nExperience working in a fully remote, international team.\nPrevious startup experience.\nExperience building or operating agentic AI systems.\nFamiliarity with MLOps practices and tools, CI/CD pipelines (e.g. GitLab CI, Argo CD), and infrastructure-as-code tools (e.g. Terraform).\nKnowledge of\nSQL/NoSQL databases\n,\nKubernetes\n, and\nLLMs\n(Large Language Models).\nWhy Join\nA small, remote-first team of passionate technologists dedicated to making the online world safer and fairer. The company’s culture is built on trust, transparency, and self-leadership - where kind, curious, and ambitious people come together to achieve extraordinary things."
  },
  {
    "title": "AI/ ML Engineer (Python)",
    "company": "proSapient",
    "location": "Greater London, England, United Kingdom",
    "job_link": "https://uk.linkedin.com/jobs/view/ai-ml-engineer-python-at-prosapient-4329704920",
    "posted_date": "1 month ago",
    "description": "Every day, somewhere in the world, important decisions are made. Whether it is a private equity company deciding to invest millions into a business or a large corporation implementing a new strategic direction, these decisions impact employees, customers, and other stakeholders.\nConsulting and private equity firms come to proSapient when they need to discover knowledge to help them make great decisions and succeed in their goals. It is our mission to support them in their discovery of knowledge.\nWe help our clients find industry experts who can provide their knowledge via interview or survey: we curate this knowledge in a market-leading software platform; and we help clients surface knowledge they already have through expansive knowledge management.\nWe are seeking an AI/ML Engineer to contribute to our AI/ML initiatives with a strong emphasis on practical software engineering using Python. This is a hands-on role combining AI/LLM-based data extraction, data analysis through various experiments, advanced recommendation engines, and backend development. You’ll work across the stack—from exploring business problems and adapting AI models to building production-grade systems that integrate into our platform.\nThis position is ideal for someone who is both analytically strong and technically capable, excited to apply AI/ML techniques to real-world challenges like expert recommendations, content extraction, and workflow automation.\nWhy Join Us?\nHelp shape meaningful AI-powered products with global reach.\nJoin a cross-functional, fast-moving team of engineers, data scientists, and product managers.\nWork on modern ML systems in a collaborative, supportive environment.\nCompetitive compensation and opportunities for career growth and technical leadership.\nKey Duties In This Role Will Include\nTranslate business problems into structured data science solutions with measurable outcomes.\nDesign and build production-grade solutions using LLM providers, Python, and databases.\nConduct and analyse experiments to evaluate the quality of data processing pipelines.\nWork with real-time data streams and search infrastructure using tools like Kafka and Elasticsearch.\nPresent findings and recommendations to both technical and non-technical stakeholders.\nRequirements\nStrong Python programming skills, with practical experience writing clean, production-ready code.\nSolid foundation with LLMs, including prompt engineering, fine-tuning, or retrieval-augmented generation (RAG).\nExperience using structured prompt-engineering and evaluation tools (e.g., LangSmith, PromptLayer).\nFamiliarity with data science libraries and pipelines (e.g., pandas, spaCy).\nExperience with Python web frameworks (e.g., FastAPI, Django) and RESTful APIs.\nProficiency in working with PostgreSQL or other relational databases.\nStrong hands-on experience with Elasticsearch, including performance optimizations and query tuning.\nBonus Skills\nExperience with message brokers like Kafka or RabbitMQ.\nFamiliarity with Docker, Kubernetes, and cloud environments (preferably AWS).\nExposure to observability tools (e.g., Prometheus, Datadog) and background job processing frameworks.\nBenefits\nTenure Gifts - Vouchers, extra holiday and sabbaticals for each year of employment.\nHealth insurance through Vitality\nEnjoy the flexibility of working remotely for up to 20 days each year, allowing you to tailor your work environment to your needs and embrace a change of scenery.\nEnhanced Maternity & Paternity pay.\nCorporate Events - From quarterly gatherings to our annual winter & Summer parties, we love to celebrate, collaborate and have fun together!\nWe are committed to building an inclusive workplace – did you know that marginalized groups are less likely to apply to jobs unless they meet every requirement listed? If you are interested in the above role, but don’t necessarily tick every box, we encourage you to apply anyway – this role could still be a great match! Take a look at our diversity statement here."
  },
  {
    "title": "AI/ ML Engineer (Python)",
    "company": "proSapient",
    "location": "London, England, United Kingdom",
    "job_link": "https://uk.linkedin.com/jobs/view/ai-ml-engineer-python-at-prosapient-4367117592",
    "posted_date": "3 weeks ago",
    "description": "Every day, somewhere in the world, important decisions are made. Whether it is a private equity company deciding to invest millions into a business or a large corporation implementing a new strategic direction, these decisions impact employees, customers, and other stakeholders.\nConsulting and private equity firms come to proSapient when they need to discover knowledge to help them make great decisions and succeed in their goals. It is our mission to support them in their discovery of knowledge.\nWe help our clients find industry experts who can provide their knowledge via interview or survey: we curate this knowledge in a market-leading software platform; and we help clients surface knowledge they already have through expansive knowledge management.\nWe are seeking an AI/ML Engineer to contribute to our AI/ML initiatives with a strong emphasis on practical software engineering using Python. This is a hands-on role combining AI/LLM-based data extraction, data analysis through various experiments, advanced recommendation engines, and backend development. You'll work across the stack—from exploring business problems and adapting AI models to building production-grade systems that integrate into our platform.\nThis position is ideal for someone who is both analytically strong and technically capable, excited to apply AI/ML techniques to real-world challenges like expert recommendations, content extraction, and workflow automation.\nWhy Join Us?\nHelp shape meaningful AI-powered products with global reach.\nJoin a cross-functional, fast-moving team of engineers, data scientists, and product managers.\nWork on modern ML systems in a collaborative, supportive environment.\nCompetitive compensation and opportunities for career growth and technical leadership.\nKey duties in this role will include:\nTranslate business problems into structured data science solutions with measurable outcomes.\nDesign and build production-grade solutions using LLM providers, Python, and databases.\nConduct and analyse experiments to evaluate the quality of data processing pipelines.\nWork with real-time data streams and search infrastructure using tools like Kafka and Elasticsearch.\nPresent findings and recommendations to both technical and non-technical stakeholders.\nRequirements\nStrong Python programming skills, with practical experience writing clean, production-ready code.\nSolid foundation with LLMs, including prompt engineering, fine-tuning, or retrieval-augmented generation (RAG).\nExperience using structured prompt-engineering and evaluation tools (e.g., LangSmith, PromptLayer).\nFamiliarity with data science libraries and pipelines (e.g., pandas, spaCy).\nExperience with Python web frameworks (e.g., FastAPI, Django) and RESTful APIs.\nProficiency in working with PostgreSQL or other relational databases.\nStrong hands-on experience with Elasticsearch, including performance optimizations and query tuning.\nBonus Skills\nExperience with message brokers like Kafka or RabbitMQ.\nFamiliarity with Docker, Kubernetes, and cloud environments (preferably AWS).\nExposure to observability tools (e.g., Prometheus, Datadog) and background job processing frameworks.\nBenefits\nTenure Gifts - Vouchers, extra holiday and sabbaticals for each year of employment.\nHealth insurance through Vitality\nEnjoy the flexibility of working remotely for up to 20 days each year, allowing you to tailor your work environment to your needs and embrace a change of scenery.\nEnhanced Maternity & Paternity pay.\nCorporate Events - From quarterly gatherings to our annual winter & Summer parties, we love to celebrate, collaborate and have fun together!\nWe are committed to building an inclusive workplace - did you know that marginalized groups are less likely to apply to jobs unless they meet every requirement listed? If you are interested in the above role, but don't necessarily tick every box, we encourage you to apply anyway - this role could still be a great match! Take a look at our diversity statement here."
  },
  {
    "title": "AI Engineer",
    "company": "DW Search",
    "location": "London Area, United Kingdom",
    "job_link": "https://uk.linkedin.com/jobs/view/ai-engineer-at-dw-search-4366362670",
    "posted_date": "3 days ago",
    "description": "AI Engineer\nNew AI startup within major investment firm\nLondon\nUp to £200k total comp\nAre you an experienced AI Engineer with a strong software engineering foundation and a track record of building AI systems that run in production?\nCome and join an AI startup spun out of a major investment firm, where you will work alongside a team with years of real commercial AI experience behind them.\nThis role is front office facing and we are looking for exceptional technical talent who care about driving business value and enjoy working closely with users. You can expect to work on greenfield AI projects using Python as a first-class language, with a strong focus on fundamentals, performance, and correctness. The work spans production LLM and ML systems, data pipelines, model deployment, monitoring, and iteration. You will be building and owning systems end to end, including infrastructure and MLOps, across Azure and AWS environments.\nIn terms of background, we are open to Data Scientist or Software Engineer backgrounds but strong Python is mandatory. We are looking for engineers who really understand Python, including internals and core language behaviour, and who are comfortable designing, deploying, and maintaining AI systems in production. You will be tested on Python fundamentals early in the process. Experience with MLOps, model lifecycle management, and operating AI systems at scale is essential.\nFinancial services experience is a plus, as you will be working closely with investors, but a genuine interest in finance is just as important.\nA compensation steer is provided within the advert, but we are looking for top-tier talent and there is flexibility for the right profile.\nFor top-tier AI Engineers, this is a rare opportunity to work alongside some of the most advanced AI practitioners in London, building systems that are used, trusted, and commercially impactful.\nApply now to be considered ASAP."
  },
  {
    "title": "AI ML Engineer",
    "company": "Digital Futures",
    "location": "London, England, United Kingdom",
    "job_link": "https://uk.linkedin.com/jobs/view/ai-ml-engineer-at-digital-futures-4315333170",
    "posted_date": "3 months ago",
    "description": "Role Overview\n:\nDesign, optimise, and deploy machine learning models powering AI agents and intelligent systems. Innovate in NLP, generative AI, and MLOps to deliver robust, scalable AI solutions.\nKey Responsibilities\n:\nDevelop ML models using libraries like Scikit-learn, Hugging Face, and LangChain.\nLead model training, tuning, and deployment activities.\nImplement MLOps pipelines enabling continuous integration/delivery of ML models.\nCollaborate with cross-functional teams for integration and system enhancements.\nResearch and prototype emergent ML techniques.\nMentor and share knowledge actively.\nRequirements\n:\n4+ years experience working within technology and/or data\nStakeholder management\nStrong team leadership and management skills\nExperience with several of the following technologies, including: Machine learning theory and applications, NLP, generative AI, Python, ML frameworks, MLOps, innovation and collaboration skills.\nWhat's in it for you?\nTailored professional development plan and upskilling\nAbility to make an impact at Digital Futures while it is in a period of accelerated growth\nAccess to our employee benefits, discounts and perks platform\nPension contributions\nWellbeing budget\nCompetitive salary\nFlexible holiday allowance on successful completion of probation\nHybrid working model with required office working days\nDigital Futures is a mission-led technology services company specialising in Artificial Intelligence (AI).\nWe have reimagined how capability is built in the age of AI, disrupting outdated workforce and education models, placing ambition at our core.\nWe're building the workforce of the future, leveraging the power of AI to drive innovation and inclusive growth.\nWe are creating a company that matters: one where pride is a strategic asset and our collective impact is measured in enduring outcomes – opportunity created, futures transformed, advantage secured."
  },
  {
    "title": "Data Scientist_ GEN AI",
    "company": "Infosys",
    "location": "London Area, United Kingdom",
    "job_link": "https://uk.linkedin.com/jobs/view/data-scientist-gen-ai-at-infosys-4356591121",
    "posted_date": "1 day ago",
    "description": "Role – Senior Lead Analyst Data Science\nTechnology – Core Python, Data Science, GEN AI\nLocation – Chester or Bromley\nBusiness Unit – Analytics\nCompensation – Competitive (including bonus)\nJob Description\nInfosys is seeking a Senior AI/ML & Generative AI Engineer with deep expertise in designing, developing, and deploying advanced AI solutions. This includes core Python development using OOPs concepts, Large Language Models (LLMs), and Agentic AI architectures. The ideal candidate will collaborate with clients to understand complex business challenges, architect scalable AI solutions, and deploy them using modern cloud platforms such as AWS, Azure ML and GCP AI Services.\nThis role offers the opportunity to work on cutting-edge technologies in Generative AI, LLM fine-tuning, agentic orchestration, and vector databases, while shaping impactful consulting solutions across industries like Banking, Finance, and Capital Markets.\n________________________________________\nYour Role\nAs a Senior Lead Analyst, you will:\n•Anchor the engagement effort from business process consulting and problem definition to solution design, development, and deployment.\n•Lead the discovery and definition of AI/ML solutions and guide teams on project processes and deliverables.\n•Act as a thought leader in your domain, advising on architecture and design reviews.\n•Drive business pursuit initiatives, client training, and in-house capability building.\n•Shape value-adding consulting solutions that help clients meet evolving business needs.\n________________________________________\nResponsibilities\n•Develop the core Python Programs using oops Concepts.\n•Design and develop scalable AI/ML solutions using Python and cloud platforms.\n•Lead the implementation of Generative AI models, LLMs, and agentic frameworks.\n•Collaborate with stakeholders to define problem statements and solution approaches.\n•Deploy models using MLOps tools such as SageMaker, Snowflake, and CI/CD pipelines.\n•Integrate vector databases and Retrieval-Augmented Generation (RAG) pipelines.\n•Ensure high-quality delivery and adherence to best practices in AI/ML engineering.\n________________________________________\nRequired\n•Strong experience in Python programming, including OOPs, data structures, Stacks, Queues, Scripting, Linkedlists, Arrays, and API development.\n•Good Experience in Big Data technologies (e.g., , Hadoop).\n•Experience in cloud platforms (AWS, Azure, GCP) and their AI/ML services.\n•Experience in ML model development, data engineering, and software engineering.\n•Experience MLOps and AI/ML deployment.\n•Experiencein Generative AI, LLMs, and agentic frameworks.\n________________________________________\nPreferred\n•Experience with API Gateway development and deployment on Azure/GCP.\n•Hands-on experience with vector databases and RAG pipelines.\n•Familiarity with CI/CD, DevOps, and automation tools in AI/ML contexts.\n•Strong problem-solving and stakeholder management skills.\n•Domain expertise in Banking, Finance, or Capital Markets.\n________________________________________\nPersonal Attributes\n•High analytical skills\n•Strong initiative and flexibility\n•High customer orientation\n•Strong quality awareness\n•Excellent verbal and written communication skills\n________________________________________\nWhy Infosys\nInfosys is a global leader in next-generation digital services and consulting. We enable clients in more than 50 countries to navigate their digital transformation. With over four decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey.\nWe do this by enabling the enterprise with an AI-powered core and agile digital at scale to deliver unprecedented performance and customer delight. Our always-on learning agenda drives continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem.\nInfosys is proud to be an equal opportunity employer. All aspects of employment are based on merit, competence, and performance. We are committed to embracing diversity and creating an inclusive environment for all employees."
  },
  {
    "title": "Artificial Intelligence Engineer",
    "company": "Techmunity",
    "location": "London Area, United Kingdom",
    "job_link": "https://uk.linkedin.com/jobs/view/artificial-intelligence-engineer-at-techmunity-4365479350",
    "posted_date": "1 week ago",
    "description": "Techmunity are exclusively hiring a Senior AI Engineer for a seed-stage London startup building a modern SaaS platform that runs back-of-house operations for enterprise hospitality brands.\nAI isn’t a bolt-on feature here. It sits at the centre of the product and the company’s future.\nThe team are moving beyond dashboards and analytics to build a real intelligence layer across forecasting, computer vision and audio-driven workflows. The goal is simple: remove operational friction in high-volume hospitality environments.\nAs the Senior AI Engineer, you’ll own how AI is designed, shipped and scaled across the platform.\nThat means deciding when to integrate best-in-class APIs (OpenAI, Anthropic, Google), when to fine-tune or run open-source models, and how everything fits into a production-grade system.\nYou’ll work closely with an experienced Engineering Manager, alongside data and DevOps peers, to build AI systems that are reliable, observable and used daily by real customers. This is very much as hands-on, product-led AI engineering position.\nThey’re looking for AI engineers who have:\nShipped AI or ML systems into production\nExperience integrating managed AI services and APIs\nHands-on work with open-source models, fine-tuning or RAG pipelines\nStrong understanding of data pipelines, inference performance and deployment\nExperience working in fast-moving startup environments\nNice to have:\nExperience with unstructured data such as video or audio\nFamiliarity with LLM orchestration tools\nExposure to hospitality, retail or operational systems\nThis Senior AI Engineer role pays up to £120,000 plus meaningful equity. VISA sponsorship available.\nThe team work 4 days per week onsite in London, with one remote day (Wednesdays or Fridays)\nIf you’re an AI engineer who wants real ownership, pace, and the chance to define an AI roadmap from early stage, message me or email reuben@techmunity.io."
  },
  {
    "title": "AI ML Engineer",
    "company": "Marks Sattin",
    "location": "London Area, United Kingdom",
    "job_link": "https://uk.linkedin.com/jobs/view/ai-ml-engineer-at-marks-sattin-4355520348",
    "posted_date": "4 days ago",
    "description": "Join a dynamic AI & Data team driving innovation in financial services. We’re seeking an experienced AI/ML Engineer to shape advanced solutions within a major Data & AI Security programme.\nKey Responsibilities:\nDesign, develop, and deploy production-ready applications using AI tools and cloud-based AI services.\nIntegrate generative AI models—such as deep learning, neural networks, chatbots, and image processing—into scalable solutions.\nLead decision-making and collaborate across teams to deliver impactful business outcomes.\nEvaluate and fine-tune AI models, driving continual improvement and high performance.\nMentor junior team members and champion best practices in AI/ML engineering.\nKey Skills:\nExpert in Microsoft Azure AI Foundry.\nAdvanced experience with Amazon Bedrock, Machine Learning, Foundation Model Fine-Tuning, Foundation Models, and AI Agents.\nAbility to deliver innovative solutions and stay ahead of new technological trends.\nContribute to high-impact AI and data security initiatives for a global financial institution, work with cutting-edge technology, and help build a culture of technical excellence."
  },
  {
    "title": "AI Engineer",
    "company": "MVF",
    "location": "London, England, United Kingdom",
    "job_link": "https://uk.linkedin.com/jobs/view/ai-engineer-at-mvf-4365908134",
    "posted_date": "3 days ago",
    "description": "The Opportunity\nOur next frontier is a strategic shift: We're evolving beyond traditional analytics to build AI agents that actively participate in our operations. Rather than using data to inform decisions, we're creating intelligent systems that autonomously deliver better outcomes for customers and clients alike. You will build the systems that transform our data from a passive record into an active participant, learning from history to autonomously optimise the business.\nYou'll be our first dedicated AI engineer, working directly with the Head of Data. You'll collaborate weekly on architecture, especially in the first 6 months, to define the technical roadmap. You'll own the build, but you're not figuring this out alone.\nWe have a small data science team shipping traditional ML such as lead scoring. Your remit is production of GenAI systems. However, we intentionally overlap deployment patterns, monitoring standards, and evaluation approaches so we build one coherent AI capability.\nWhat You Will Do\nArchitect & Engineer Agentic Systems\nBuild agents that act, not just answer: You will design agents that perform deterministic actions based on probabilistic reasoning. This means building systems that can reliably analyse data, execute function calls, and manage state across multi-step workflows without getting stuck in loops.\nProduction-Grade RAG: You will go beyond basic vector search. You will implement hybrid search (keyword + semantic), re-ranking strategies, and metadata filtering to ensure our agents have the exact context they need to make decisions.\nStructured Data Extraction: You will build pipelines that turn unstructured conversations into structured data that our downstream systems can use.\nEstablish AI Engineering Foundations\nObservability First: You will implement the \"nervous system\" of our AI. You will choose and set up tools (e.g., LangSmith, LangFuse, ADK, or custom) to trace execution chains, giving us visibility into why an agent made a specific decision.\nEvals as a Service: You will build the testing harness. You will create automated evaluation pipelines that test prompts against \"Golden Datasets\" so we can deploy with confidence, ensuring a prompt change doesn't degrade performance.\nCost & Latency Engineering: You will monitor token usage and inference latency, optimising the trade-off between model intelligence and speed/cost for different parts of the chain.\nCollaborate and Standardise\nPartner on Architecture: You will work with the Head of Data to define the technical roadmap. You aren't just taking tickets; you are helping decide what we build based on technical feasibility and business value.\nUnify with Data Science: You will define shared standards with our Data Science team on deployment patterns, monitoring, and security, ensuring we build one coherent AI platform, not silos.\nWhat This Role Requires:\nMust Have\nPython and service development: You write clean, typed, production-ready code. You are comfortable with Pydantic (for data validation), Asyncio (for handling concurrent model calls), and FastAPI. You treat prompts as code: versioned, tested, and decoupled from business logic.\nCloud-native experience: You have hands-on experience deploying and operating containerised services on AWS (or GCP/Azure) using CI/CD platforms (Jenkins, GitHub Actions, CircleCI, BuildKite), cloud monitoring tools (Datadog, Sumologic, NewRelic), and container orchestrators (EKS, ECS). You're comfortable with Terraform for infrastructure as code.\nHands-on LLM experience: You've built something real with language models, whether production systems, serious side projects, or internal tools. You understand that prompting is engineering, not magic.\nNice to Have\nProduction GenAI at scale: Experience with structured outputs, managing context window constraints, and handling model latency/timeouts in user-facing applications. You know how to evaluate a change in prompt logic before deploying it.\nObservability and evaluation pipelines: You've implemented tracing for LLM workflows or built automated evaluation against golden datasets.\nImportant Traits\nProactive Ownership & Communication: GenAI projects are prone to hype. You have the confidence to manage stakeholder expectations effectively, explaining trade-offs between cost, latency, and quality. When blocked, you don't just ask for help, you present options.\nTranslating \"Fuzzy\" to \"Formal\". Marketing problems are often vague (\"Find better leads\"). You can take a fuzzy business objective and break it down into a deterministic engineering problem: a set of tools, a prompting strategy, and a metric to measure success.\nPragmatism over Hype. You read the AI research papers, but you deploy what works. You'd rather use a simple few-shot prompt that is reliable and cheap than a complex autonomous agent framework that is flaky and expensive. You understand that \"boring\" code is easier to debug.\nThe Tech Reality\nThe Foundation (Fixed & Reliable)\nWe believe in “innovation tokens”. We spend them on the AI application layer, not the infrastructure.\nAWS: ECS/Fargate, ECR. We prioritise velocity over complexity. CI/CD pipelines and Terraform to deploy, essentially shipping containerised services without the operational headache of managing raw Kubernetes clusters.\nData Layer: Snowflake & dbt. Our data is modeled, clean, and accessible. You won't spend your first 3 months scraping PDFs; you have rich, structured data ready to consume.\nThe Canvas (Your Architectural Decisions)\nThe “AI Layer” is currently undefined. You will work with the Head of Data to select the stack that fits our specific agentic needs.\nModel Strategy: Totally open. We're pragmatic: we use whatever model offers the best trade-off for the task, and build the necessary infrastructure to access it securely.\nOrchestration: Do we use a framework like LangChain or LlamaIndex, or do we write lightweight, controllable Python code? That's your call.\nObservability: How do we trace complex agent workflows? Options include LangSmith, LangFuse, or custom solutions. You will choose the tool that gives us the best visibility into \"why did the bot do that?\"\nRetrieval/Memory: Do we use a vector database like Pinecone or Weaviate? Do we leverage Snowflake Cortex for native vector search to keep data in one place? How do we handle long-term agent memory?\nEvaluation: How do we unit test a prompt? You will define the frameworks and \"Golden Datasets\" we use to measure success.\nWhat We Offer\nArchitectural Authority: As the first hire, you define the patterns and standards, not inherit legacy debt.\nEngineering Leverage: You have the resources for proper tools (LangSmith, Model APIs) and access to clean data immediately.\nStrategic Partnership: You work with the Head of Data as a technical co-founder for internal AI products, shaping the roadmap together.\nHigh-Velocity Impact: We ship in weeks. Your agents will directly touch spend and revenue.\nBenefits we offer:\nSummer Fridays\nCompetitive holiday benefits - 25 days a year paid holiday, plus 8 bank holidays (increases 1 day a year up to 30 days)\nHybrid working - 3 days a week in the office\nClosed for Christmas holidays - Extra days not taken from your annual holiday allowance.\nWork from anywhere for 2 weeks a year\nLife Assurance and Income Protection to protect your loved ones\nBenefits allowance for health, dental, and vision coverage\nSix months paid maternity leave, and one month paid paternity leave (subject to qualifying conditions) inclusive of same-sex and adoptive parents\nDefined Contribution Pension and Salary Sacrifice Scheme\nBe Well: Our award-winning wellbeing and mental health programme to support all MVFers and their families\nFamily Forward support for our MVF parents and their mini-mes\n2 charity days a year\nFree breakfast when in the office"
  },
  {
    "title": "AI Training - Machine Learning Specialist (UK)",
    "company": "Prolific",
    "location": "London, England, United Kingdom",
    "job_link": "https://uk.linkedin.com/jobs/view/ai-training-machine-learning-specialist-uk-at-prolific-4351959618",
    "posted_date": "N/A",
    "description": "]:pointer-events-auto scroll-mt-[calc(var(--header-height)+min(200px,max(70px,20svh)))]\" data-turn-id=\"7d8c6042-ac58-4acb-b90b-d08242002c4b\" data-testid=\"conversation-turn-6\" data-scroll-anchor=\"true\" data-turn=\"assistant\">\n]:pointer-events-auto scroll-mt-[calc(var(--header-height)+min(200px,max(70px,20svh)))]\" data-turn-id=\"788a8b78-cfcd-42e1-beb1-30da5949a95d\" data-testid=\"conversation-turn-8\" data-scroll-anchor=\"true\" data-turn=\"assistant\">\nAI Trainer – Machine Learning Specialists\nAbout Prolific\nProlific is not just another player in the AI space – we are building the biggest pool of quality human data in the world.\nOver 35,000 AI developers, researchers, and organizations use Prolific to gather data from paid study participants with a wide variety of experiences, knowledge, and skills.\nThe role\nWe're looking for\nAI Trainer – Machine Learning Specialists\nto help train and evaluate cutting-edge AI models using real ML expertise. If you have the necessary experience, we'll send you a quick\n10- to 15-minute test\nto assess your skills and suitability for AI tasks. If successful, you'll be invited to join Prolific as a participant, where you'll get paid to train and evaluate powerful AI models.\nResearchers looking for your skills tend to pay up to\n$150/hr per AI task completed\n. You must be prepared to complete paid tasks that require\none hour of uninterrupted work\n, though many are shorter.\nWhat you'll bring\nAI Training task skills and verifiable professional experience as a Machine Learning Specialist (e.g., ML engineer, data scientist, applied scientist, research engineer)\nA willingness to take our skills verification test to assess your suitability for our participant pool\nStrong attention to detail and the ability to concentrate on complex tasks for up to one hour at a time\nA reliable and fast internet connection and access to a computer\nA willingness to self-declare your earnings, as our participants are self-employed\nA Paypal account to receive payment from our clients\nWhat you'll be doing in the role\nCompleting AI training tasks such as analyzing, editing, and writing annotations (including technical reasoning and structured evaluation)\nJudging the performance of AI in performing ML-relevant tasks (e.g., model/experiment critique, data leakage detection, metrics interpretation, debugging approach, methodology review)\nImproving cutting-edge AI models by providing expert feedback on correctness, robustness, clarity, and technical depth\nKey Technologies\nGeneral AI Training\nModel Evaluation and Evals\nTrust and Safety\nRed Teaming\nQuality Analytics\nData/ML Concepts (e.g., supervised learning, deep learning, NLP, CV, statistics, experimentation)\nWhy Prolific is a great platform to join as a Participant\nJoining our platform as a Prolific participant will give you the chance to influence the AI models of the future using professional machine learning expertise. Once you pass our assessment, you can join Prolific in just 15 minutes, and start enjoying competitive pay rates, flexible hours, and the ability to work from home.\nWe've built a unique platform that connects researchers and companies with a global pool of participants, enabling the collection of high-quality, ethically sourced human behavioural data and feedback. This data is the cornerstone of developing more accurate, nuanced, and aligned AI systems.\nWe believe that the next leap in AI capabilities won't come solely from scaling existing models, but from integrating diverse human perspectives and behaviours into AI development. By providing this crucial human data infrastructure, Prolific is positioning itself at the forefront of the next wave of AI innovation – one that reflects the breath and the best of humanity.\nLinks to more information on Prolific\nWebsite\nYoutube\nPrivacy Statement\nBy submitting your application, you agree that Prolific may collect your personal data for recruiting and global organisation planning. Prolific's Candidate Privacy Notice explains what personal information Prolific may process, where Prolific may process your personal information, its purposes for processing your personal information, and the rights you can exercise over Prolific use of your personal personal information."
  }
]