[
  {
    "title": "Machine Learning Engineer",
    "company": "WRK digital",
    "location": "London Area, United Kingdom",
    "job_link": "https://uk.linkedin.com/jobs/view/machine-learning-engineer-at-wrk-digital-4365114810",
    "posted_date": "1 week ago",
    "description": "Machine Learning Engineer - Outside IR35\nLocation:\nFully Remote - UK\nContract Length:\n3 months initially\nIR35 Status:\nOutside IR35\nStart Date:\nImmediate\n£550-600/day\nWRK digital\nis proud to partner with a fast-growing technology startup building solutions that combine human expertise and AI agents to automate complex operational workflows. The organisations mission is to help businesses solve real-world challenges in areas such as trust, safety, and marketplace operations - enabling them to scale efficiently without the need for complex integrations.\nHaving recently raised over $25M in venture funding from top-tier investors, the company is operating at significant scale, processing millions of images and videos daily. This is an exciting stage of their journey as they look to expand the platform and capabilities over the coming year and beyond.\nThe Role\nWe’re shortlisting for an experienced\nMachine Learning Engineer\nto design, build, and deliver cutting-edge AI solutions for customers. You’ll apply your expertise in software engineering and machine learning to transform manual workflows into automated systems powered by AI.\nYou’ll work closely with customers and internal teams to understand their challenges, develop virtual agents that automate tasks, and build scalable, self-service tools that empower users to achieve value independently.\nKey Responsibilities\nCollaborate with customers to understand workflows and design AI-driven automation solutions.\nContribute to the development of our Virtual Agent platform in line with product strategy.\nEnsure AI services maintain high standards of performance, reliability, and scalability.\nParticipate in internal ML community, influencing how we implement AI and computer vision technologies.\nTake ownership of customer outcomes and contribute across software engineering, DevOps, and MLOps functions.\nAbout You\nWe’re looking for a proactive and versatile engineer who thrives in a collaborative environment and enjoys solving meaningful technical challenges. You’ll be comfortable engaging with customers and internal stakeholders, driving technical delivery, and contributing ideas that shape our product roadmap.\nYou’ll be great for this role if you:\nHave strong\nPython\nand\nmachine learning engineering\nskills, with experience applying AI to real-world problems.\nCan (or want to learn to) build\nagentic AI systems\nthat automate human processes.\nUnderstand (or are keen to learn) software deployment using\nKubernetes\nand related infrastructure tools.\nHave strong problem-solving and project management skills.\nThrive in a collaborative environment where shared success matters most.\nAre open to occasional travel for company-wide gatherings (typically three times per year).\nNice to Have:\nExperience working in a fully remote, international team.\nPrevious startup experience.\nExperience building or operating agentic AI systems.\nFamiliarity with MLOps practices and tools, CI/CD pipelines (e.g. GitLab CI, Argo CD), and infrastructure-as-code tools (e.g. Terraform).\nKnowledge of\nSQL/NoSQL databases\n,\nKubernetes\n, and\nLLMs\n(Large Language Models).\nWhy Join\nA small, remote-first team of passionate technologists dedicated to making the online world safer and fairer. The company’s culture is built on trust, transparency, and self-leadership - where kind, curious, and ambitious people come together to achieve extraordinary things.",
    "employees": []
  },
  {
    "title": "AI/ ML Engineer (Python)",
    "company": "proSapient",
    "location": "Greater London, England, United Kingdom",
    "job_link": "https://uk.linkedin.com/jobs/view/ai-ml-engineer-python-at-prosapient-4329704920",
    "posted_date": "1 month ago",
    "description": "Every day, somewhere in the world, important decisions are made. Whether it is a private equity company deciding to invest millions into a business or a large corporation implementing a new strategic direction, these decisions impact employees, customers, and other stakeholders.\nConsulting and private equity firms come to proSapient when they need to discover knowledge to help them make great decisions and succeed in their goals. It is our mission to support them in their discovery of knowledge.\nWe help our clients find industry experts who can provide their knowledge via interview or survey: we curate this knowledge in a market-leading software platform; and we help clients surface knowledge they already have through expansive knowledge management.\nWe are seeking an AI/ML Engineer to contribute to our AI/ML initiatives with a strong emphasis on practical software engineering using Python. This is a hands-on role combining AI/LLM-based data extraction, data analysis through various experiments, advanced recommendation engines, and backend development. You’ll work across the stack—from exploring business problems and adapting AI models to building production-grade systems that integrate into our platform.\nThis position is ideal for someone who is both analytically strong and technically capable, excited to apply AI/ML techniques to real-world challenges like expert recommendations, content extraction, and workflow automation.\nWhy Join Us?\nHelp shape meaningful AI-powered products with global reach.\nJoin a cross-functional, fast-moving team of engineers, data scientists, and product managers.\nWork on modern ML systems in a collaborative, supportive environment.\nCompetitive compensation and opportunities for career growth and technical leadership.\nKey Duties In This Role Will Include\nTranslate business problems into structured data science solutions with measurable outcomes.\nDesign and build production-grade solutions using LLM providers, Python, and databases.\nConduct and analyse experiments to evaluate the quality of data processing pipelines.\nWork with real-time data streams and search infrastructure using tools like Kafka and Elasticsearch.\nPresent findings and recommendations to both technical and non-technical stakeholders.\nRequirements\nStrong Python programming skills, with practical experience writing clean, production-ready code.\nSolid foundation with LLMs, including prompt engineering, fine-tuning, or retrieval-augmented generation (RAG).\nExperience using structured prompt-engineering and evaluation tools (e.g., LangSmith, PromptLayer).\nFamiliarity with data science libraries and pipelines (e.g., pandas, spaCy).\nExperience with Python web frameworks (e.g., FastAPI, Django) and RESTful APIs.\nProficiency in working with PostgreSQL or other relational databases.\nStrong hands-on experience with Elasticsearch, including performance optimizations and query tuning.\nBonus Skills\nExperience with message brokers like Kafka or RabbitMQ.\nFamiliarity with Docker, Kubernetes, and cloud environments (preferably AWS).\nExposure to observability tools (e.g., Prometheus, Datadog) and background job processing frameworks.\nBenefits\nTenure Gifts - Vouchers, extra holiday and sabbaticals for each year of employment.\nHealth insurance through Vitality\nEnjoy the flexibility of working remotely for up to 20 days each year, allowing you to tailor your work environment to your needs and embrace a change of scenery.\nEnhanced Maternity & Paternity pay.\nCorporate Events - From quarterly gatherings to our annual winter & Summer parties, we love to celebrate, collaborate and have fun together!\nWe are committed to building an inclusive workplace – did you know that marginalized groups are less likely to apply to jobs unless they meet every requirement listed? If you are interested in the above role, but don’t necessarily tick every box, we encourage you to apply anyway – this role could still be a great match! Take a look at our diversity statement here.",
    "employees": []
  },
  {
    "title": "AI/ ML Engineer (Python)",
    "company": "proSapient",
    "location": "London, England, United Kingdom",
    "job_link": "https://uk.linkedin.com/jobs/view/ai-ml-engineer-python-at-prosapient-4367117592",
    "posted_date": "3 weeks ago",
    "description": "Every day, somewhere in the world, important decisions are made. Whether it is a private equity company deciding to invest millions into a business or a large corporation implementing a new strategic direction, these decisions impact employees, customers, and other stakeholders.\nConsulting and private equity firms come to proSapient when they need to discover knowledge to help them make great decisions and succeed in their goals. It is our mission to support them in their discovery of knowledge.\nWe help our clients find industry experts who can provide their knowledge via interview or survey: we curate this knowledge in a market-leading software platform; and we help clients surface knowledge they already have through expansive knowledge management.\nWe are seeking an AI/ML Engineer to contribute to our AI/ML initiatives with a strong emphasis on practical software engineering using Python. This is a hands-on role combining AI/LLM-based data extraction, data analysis through various experiments, advanced recommendation engines, and backend development. You'll work across the stack—from exploring business problems and adapting AI models to building production-grade systems that integrate into our platform.\nThis position is ideal for someone who is both analytically strong and technically capable, excited to apply AI/ML techniques to real-world challenges like expert recommendations, content extraction, and workflow automation.\nWhy Join Us?\nHelp shape meaningful AI-powered products with global reach.\nJoin a cross-functional, fast-moving team of engineers, data scientists, and product managers.\nWork on modern ML systems in a collaborative, supportive environment.\nCompetitive compensation and opportunities for career growth and technical leadership.\nKey duties in this role will include:\nTranslate business problems into structured data science solutions with measurable outcomes.\nDesign and build production-grade solutions using LLM providers, Python, and databases.\nConduct and analyse experiments to evaluate the quality of data processing pipelines.\nWork with real-time data streams and search infrastructure using tools like Kafka and Elasticsearch.\nPresent findings and recommendations to both technical and non-technical stakeholders.\nRequirements\nStrong Python programming skills, with practical experience writing clean, production-ready code.\nSolid foundation with LLMs, including prompt engineering, fine-tuning, or retrieval-augmented generation (RAG).\nExperience using structured prompt-engineering and evaluation tools (e.g., LangSmith, PromptLayer).\nFamiliarity with data science libraries and pipelines (e.g., pandas, spaCy).\nExperience with Python web frameworks (e.g., FastAPI, Django) and RESTful APIs.\nProficiency in working with PostgreSQL or other relational databases.\nStrong hands-on experience with Elasticsearch, including performance optimizations and query tuning.\nBonus Skills\nExperience with message brokers like Kafka or RabbitMQ.\nFamiliarity with Docker, Kubernetes, and cloud environments (preferably AWS).\nExposure to observability tools (e.g., Prometheus, Datadog) and background job processing frameworks.\nBenefits\nTenure Gifts - Vouchers, extra holiday and sabbaticals for each year of employment.\nHealth insurance through Vitality\nEnjoy the flexibility of working remotely for up to 20 days each year, allowing you to tailor your work environment to your needs and embrace a change of scenery.\nEnhanced Maternity & Paternity pay.\nCorporate Events - From quarterly gatherings to our annual winter & Summer parties, we love to celebrate, collaborate and have fun together!\nWe are committed to building an inclusive workplace - did you know that marginalized groups are less likely to apply to jobs unless they meet every requirement listed? If you are interested in the above role, but don't necessarily tick every box, we encourage you to apply anyway - this role could still be a great match! Take a look at our diversity statement here.",
    "employees": []
  },
  {
    "title": "AI Engineer",
    "company": "DW Search",
    "location": "London Area, United Kingdom",
    "job_link": "https://uk.linkedin.com/jobs/view/ai-engineer-at-dw-search-4366362670",
    "posted_date": "3 days ago",
    "description": "AI Engineer\nNew AI startup within major investment firm\nLondon\nUp to £200k total comp\nAre you an experienced AI Engineer with a strong software engineering foundation and a track record of building AI systems that run in production?\nCome and join an AI startup spun out of a major investment firm, where you will work alongside a team with years of real commercial AI experience behind them.\nThis role is front office facing and we are looking for exceptional technical talent who care about driving business value and enjoy working closely with users. You can expect to work on greenfield AI projects using Python as a first-class language, with a strong focus on fundamentals, performance, and correctness. The work spans production LLM and ML systems, data pipelines, model deployment, monitoring, and iteration. You will be building and owning systems end to end, including infrastructure and MLOps, across Azure and AWS environments.\nIn terms of background, we are open to Data Scientist or Software Engineer backgrounds but strong Python is mandatory. We are looking for engineers who really understand Python, including internals and core language behaviour, and who are comfortable designing, deploying, and maintaining AI systems in production. You will be tested on Python fundamentals early in the process. Experience with MLOps, model lifecycle management, and operating AI systems at scale is essential.\nFinancial services experience is a plus, as you will be working closely with investors, but a genuine interest in finance is just as important.\nA compensation steer is provided within the advert, but we are looking for top-tier talent and there is flexibility for the right profile.\nFor top-tier AI Engineers, this is a rare opportunity to work alongside some of the most advanced AI practitioners in London, building systems that are used, trusted, and commercially impactful.\nApply now to be considered ASAP.",
    "employees": []
  },
  {
    "title": "AI ML Engineer",
    "company": "Digital Futures",
    "location": "London, England, United Kingdom",
    "job_link": "https://uk.linkedin.com/jobs/view/ai-ml-engineer-at-digital-futures-4315333170",
    "posted_date": "3 months ago",
    "description": "Role Overview\n:\nDesign, optimise, and deploy machine learning models powering AI agents and intelligent systems. Innovate in NLP, generative AI, and MLOps to deliver robust, scalable AI solutions.\nKey Responsibilities\n:\nDevelop ML models using libraries like Scikit-learn, Hugging Face, and LangChain.\nLead model training, tuning, and deployment activities.\nImplement MLOps pipelines enabling continuous integration/delivery of ML models.\nCollaborate with cross-functional teams for integration and system enhancements.\nResearch and prototype emergent ML techniques.\nMentor and share knowledge actively.\nRequirements\n:\n4+ years experience working within technology and/or data\nStakeholder management\nStrong team leadership and management skills\nExperience with several of the following technologies, including: Machine learning theory and applications, NLP, generative AI, Python, ML frameworks, MLOps, innovation and collaboration skills.\nWhat's in it for you?\nTailored professional development plan and upskilling\nAbility to make an impact at Digital Futures while it is in a period of accelerated growth\nAccess to our employee benefits, discounts and perks platform\nPension contributions\nWellbeing budget\nCompetitive salary\nFlexible holiday allowance on successful completion of probation\nHybrid working model with required office working days\nDigital Futures is a mission-led technology services company specialising in Artificial Intelligence (AI).\nWe have reimagined how capability is built in the age of AI, disrupting outdated workforce and education models, placing ambition at our core.\nWe're building the workforce of the future, leveraging the power of AI to drive innovation and inclusive growth.\nWe are creating a company that matters: one where pride is a strategic asset and our collective impact is measured in enduring outcomes – opportunity created, futures transformed, advantage secured.",
    "employees": []
  }
]